import numpy as np
a = np.array([0.9764007425682037, -0.27226100028552364, 1.8150566682870022, 0.1122149723363356, 1.0973661132324832, 3.8960984146584314])
print("a:", a*180/3.141592653589793)
# import numpy as np
# from math import exp, pi
# f_c = 20
# f_s = 100
# alpha = 1 - exp(-2 * pi * f_c / f_s) # 越小越平滑但反應越慢
# print("alpha:", alpha)

# f = np.array([0,0,1])
# print(f.shape)
# print(f.T.shape)
# import numpy as np
# from scipy.spatial.transform import Rotation as R

# # 把論文的 24 個 R_i 按順序放進來（你也可沿用現成的 R_list）
# R_list = [
#     [[1,0,0],[0,1,0],[0,0,1]],   [[1,0,0],[0,-1,0],[0,0,-1]],
#     [[1,0,0],[0,0,-1],[0,1,0]],  [[1,0,0],[0,0,1],[0,-1,0]],
#     [[-1,0,0],[0,1,0],[0,0,-1]],  [[-1,0,0],[0,-1,0],[0,0,1]],
#     [[-1,0,0],[0,0,1],[0,1,0]],   [[-1,0,0],[0,0,-1],[0,-1,0]],
#     [[0,1,0],[1,0,0],[0,0,-1]],  [[0,-1,0],[1,0,0],[0,0,1]],
#     [[0,0,1],[1,0,0],[0,1,0]], [[0,0,-1],[1,0,0],[0,-1,0]],
#     [[0,1,0],[-1,0,0],[0,0,1]], [[0,-1,0],[-1,0,0],[0,0,-1]],
#     [[0,0,-1],[-1,0,0],[0,1,0]],  [[0,0,1],[-1,0,0],[0,-1,0]],
#     [[0,1,0],[0,0,1],[1,0,0]],  [[0,-1,0],[0,0,-1],[1,0,0]],
#     [[0,0,-1],[0,1,0],[1,0,0]],   [[0,0,1],[0,-1,0],[1,0,0]],
#     [[0,1,0],[0,0,-1],[-1,0,0]], [[0,-1,0],[0,0,1],[-1,0,0]],
#     [[0,0,1],[0,1,0],[-1,0,0]],  [[0,0,-1],[0,-1,0],[-1,0,0]],
# ]

# # 轉為 Euler (XYZ) = [Rx, Ry, Rz]，單位：度
# eulers_deg = []
# for Ri in R_list:
#     ang = R.from_matrix(np.array(Ri)).as_euler('xyz', degrees=True)
#     # 讓角度落在 [-180,180)
#     ang = (ang + 180.0) % 360.0 - 180.0
#     eulers_deg.append(ang)

# eulers_deg = np.array(eulers_deg)
# for i, (rx,ry,rz) in enumerate(eulers_deg, 1):
#     print(f"R{i:02d}: Rx={rx:7.2f}°, Ry={ry:7.2f}°, Rz={rz:7.2f}°")

# # import numpy as np

# # R_list = [
# #     [[0,0,1],[1,0,0],[0,1,0]],   [[0,0,-1],[1,0,0],[0,-1,0]],
# #     [[0,-1,0],[1,0,0],[0,0,1]],  [[0,1,0],[1,0,0],[0,0,-1]],
# #     [[1,0,0],[0,0,-1],[0,1,0]],  [[1,0,0],[0,0,1],[0,-1,0]],
# #     [[1,0,0],[0,1,0],[0,0,1]],   [[1,0,0],[0,-1,0],[0,0,-1]],
# #     [[0,0,1],[0,1,0],[-1,0,0]],  [[0,0,-1],[0,1,0],[1,0,0]],
# #     [[-1,0,0],[0,-1,0],[0,0,1]], [[-1,0,0],[0,1,0],[0,0,-1]],
# #     [[0,1,0],[0,0,-1],[-1,0,0]], [[0,1,0],[0,0,1],[1,0,0]],
# #     [[0,1,0],[-1,0,0],[0,0,1]],  [[0,1,0],[1,0,0],[0,0,-1]],
# #     [[0,0,1],[0,1,0],[-1,0,0]],  [[0,0,1],[0,-1,0],[1,0,0]],
# #     [[0,0,1],[1,0,0],[0,1,0]],   [[0,0,1],[-1,0,0],[0,-1,0]],
# #     [[0,-1,0],[0,0,1],[-1,0,0]], [[0,1,0],[0,0,1],[1,0,0]],
# #     [[1,0,0],[0,0,1],[0,-1,0]],  [[-1,0,0],[0,0,1],[0,1,0]],
# # ]

# # # new paper
# # R_list_2 = [
# #     [[1,0,0],[0,1,0],[0,0,1]],   [[1,0,0],[0,-1,0],[0,0,-1]],
# #     [[1,0,0],[0,0,-1],[0,1,0]],  [[1,0,0],[0,0,1],[0,-1,0]],
# #     [[-1,0,0],[0,1,0],[0,0,-1]],  [[-1,0,0],[0,-1,0],[0,0,1]],
# #     [[-1,0,0],[0,0,1],[0,1,0]],   [[-1,0,0],[0,0,-1],[0,-1,0]],
# #     [[0,1,0],[1,0,0],[0,0,-1]],  [[0,-1,0],[1,0,0],[0,0,1]],
# #     [[0,0,1],[1,0,0],[0,1,0]], [[0,0,-1],[1,0,0],[0,-1,0]],
# #     [[0,1,0],[-1,0,0],[0,0,1]], [[0,-1,0],[-1,0,0],[0,0,-1]],
# #     [[0,0,-1],[-1,0,0],[0,1,0]],  [[0,0,1],[-1,0,0],[0,-1,0]],
# #     [[0,1,0],[0,0,1],[1,0,0]],  [[0,-1,0],[0,0,-1],[1,0,0]],
# #     [[0,0,-1],[0,1,0],[1,0,0]],   [[0,0,1],[0,-1,0],[1,0,0]],
# #     [[0,1,0],[0,0,-1],[-1,0,0]], [[0,-1,0],[0,0,1],[-1,0,0]],
# #     [[0,0,1],[0,1,0],[-1,0,0]],  [[0,0,-1],[0,-1,0],[-1,0,0]],
# # ]


# # def matrix_to_tuple(matrix):
# #     return tuple(tuple(row) for row in matrix)

# # set1 = set(matrix_to_tuple(m) for m in R_list)
# # set2 = set(matrix_to_tuple(m) for m in R_list_2)

# # only_in_2 = set2 - set1
# # only_in_1 = set1 - set2

# # print("R_list_2中有但R_list沒有的矩陣:")
# # for mat in only_in_2:
# #     print(np.array(mat),",")

# # print("\nR_list中有但R_list_2沒有的矩陣:")
# # for mat in only_in_1:
# #     print(np.array(mat))



# # from scipy.spatial.transform import Rotation as R
# # import numpy as np

# # x_p = 0.4
# # y_p = 0.0
# # z_p = 0.2
# # rx_p = 0.0
# # ry_p = 0.0
# # rz_p = 0.0

# # pose_before = [x_p, y_p, z_p, rx_p, ry_p, rz_p]

# # x = 0.7
# # y = 0.2
# # z = 0.6
# # rx = 0.1
# # ry = 0.3
# # rz = 0.0

# # pose_after = [x, y, z, rx, ry, rz]

# # def get_transform_matrix(pose_before, pose_after):
# #     R1 = R.from_euler('xyz', pose_before[3:]).as_matrix()
# #     T1 = np.eye(4)
# #     T1[:3, :3] = R1
# #     T1[:3, 3] = pose_before[:3]

# #     R2 = R.from_euler('xyz', pose_after[3:]).as_matrix()
# #     T2 = np.eye(4)
# #     T2[:3, :3] = R2
# #     T2[:3, 3] = pose_after[:3]
# #     T = np.linalg.inv(T1) @ T2
# #     return T
# # def main():
# #     T = get_transform_matrix(pose_before, pose_after)
# #     print("Transform Matrix:")
# #     print(T)

# #     # Extract translation and rotation
# #     translation = T[:3, 3]
# #     rotation_matrix = T[:3, :3]
    
# #     # Convert rotation matrix to Euler angles (ZYX)
# #     r = R.from_matrix(rotation_matrix)
# #     euler_angles = r.as_euler('xyz', degrees=True)

# #     print("Translation:", translation)
# #     print("Rotation (Euler angles in degrees):", euler_angles)

# # if __name__ == "__main__":
# #     main()
